app/controllers/posts_controller.rb

  def index
    @category = Category.find params[:category_id]
    @posts = Post.where(category_id: params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = 2 LIMIT 1

  def create
    @post = Post.new(params[:post])
    @post.category_id = params[:category_id]
    @post.save
---
INSERT INTO "posts" ("category_id", "content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", nil], ["content", "sdgsdfgsdfgsfdgsfd"], ["created_at", Mon, 28 Oct 2013 23:53:17 UTC +00:00], ["title", "sfggsdgsdf"], ["updated_at", Mon, 28 Oct 2013 23:53:17 UTC +00:00]]

  def edit
    @post_to_edit = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
    @post = Post.find(params[:id])
    @post.update_attributes(title: params[:post][:title], content: params[:post][:content])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "title" = NULL, "content" = NULL, "updated_at" = '2013-10-29 03:01:37.854622' WHERE "posts"."id" = 2

  def destroy
    @post_to_be_deleted = Post.find(params[:id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "3"]]